Tekla Open API Reference for Tekla Structures 2025
Picker.PickObjectAndPoint Method
 Requests the user to pick one object. Returns the picked drawing object, the view in which the pick occurred and picked point in the view coordinates.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Tuple<DrawingObject, ViewBase, Point> PickObjectAndPoint(
	string prompt
)
Public Function PickObjectAndPoint (
	prompt As String
) As Tuple(Of DrawingObject, ViewBase, Point)
Parameters
prompt
Type: System.String
The prompt shown in the status bar before the pick. See the class remarks for more information about prompts.
Return Value
Type: Tuple<DrawingObject, ViewBase, Point>
[Missing <returns> documentation for "M:Tekla.Structures.Drawing.UI.Picker.PickObjectAndPoint(System.String)"]
Exceptions
Exception | Condition
InvalidPluginPickerInputException |  Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
PickerInterruptedException |  Thrown when the user interrupts the picker before anything has been picked.
See Also
Reference
Picker Class
Tekla.Structures.Drawing.UI Namespace